app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    render json: banned_items_filter(Item.all)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def show
    render json: banned_item_filter(Item.find(params[:id]))

SELECT "items".* FROM "items" WHERE (category = '2')
---
  def category
    render json: banned_items_filter(Item.where("category = ?", params[:category]))

SELECT "items".* FROM "items" WHERE (seller_name = 'jim' AND status = '2')
---
  def seller_status
    render json: banned_items_filter(Item.where("seller_name = ? AND status = ?", params[:seller], params[:status]))